app/controllers/albums_controller.rb

SELECT "albums"."id" FROM "albums" WHERE "albums"."id" = 1 AND ("albums".user_id = 2) LIMIT 1
SELECT "images".* FROM "images" WHERE "images"."album_id" = 1 ORDER BY mark DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "images" WHERE "images"."album_id" = 1
---
  def show
    @album = Album.find(params[:id])
    @album_images = Image.where(:album_id => @album.id).order("mark DESC").page(params[:page])