app/views/images/_image.html.haml

SELECT "albums"."id" FROM "albums" WHERE "albums"."id" = 1 AND ("albums".user_id = 2) LIMIT 1
---
-album = Album.find(image.album_id)